app/controllers/books_controller.rb

  def change_state
      @book = Book.find(params[:book_id])
      if @book
        @book.fire_state_event(params[:book])
        @book.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "books" SET "state" = 'downloaded', "updated_at" = '2012-12-24 15:38:38.272695' WHERE "books"."id" = 5

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "created_at", "description", "number_of_pages", "production_year", "publishing_house", "state", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "number_of_pages" = 234, "updated_at" = '2012-12-22 16:59:05.874324' WHERE "books"."id" = 1